CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_CAM_D_7_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_CAM_D_7_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_CAM_D_7_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_CAM_D_7_PIN 15U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_CAM_D_7_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC18 (number 125), CAM_PCLK
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_CAM_PCLK_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_CAM_PCLK_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_CAM_PCLK_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_CAM_PCLK_PIN 18U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_CAM_PCLK_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTE4 (number 7), SD_D_3
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_SD_D_3_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_SD_D_3_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_SD_D_3_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_SD_D_3_PIN 4U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_SD_D_3_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTE5 (number 8), SD_D_2
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_SD_D_2_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_SD_D_2_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_SD_D_2_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_SD_D_2_PIN 5U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_SD_D_2_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTA0 (number 50), SWO_CLK
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_SWO_CLK_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_SWO_CLK_PIN 0U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_SWO_CLK_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTA3 (number 53), SWO_DIO
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_SWO_DIO_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_SWO_DIO_PIN 3U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_SWO_DIO_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTA5 (number 55), RST
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_RST_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_RST_PIN 5U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_RST_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                  /* @} */

/*! @name PORTD8 (number 137), IMU_SCL
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_IMU_SCL_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_IMU_SCL_PIN 8U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_IMU_SCL_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTD9 (number 138), IMU_SDA
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_IMU_SDA_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_IMU_SDA_PIN 9U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_IMU_SDA_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTD14 (number 143), OLED_SOT
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_OLED_SOT_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_OLED_SOT_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_OLED_SOT_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_OLED_SOT_PIN 14U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_OLED_SOT_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTD15 (number 144), OLED_D_C
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_OLED_D_C_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_OLED_D_C_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_OLED_D_C_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_OLED_D_C_PIN 15U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_OLED_D_C_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTE7 (number 10), BUTTON_OK
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_BUTTON_OK_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_BUTTON_OK_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_BUTTON_OK_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_BUTTON_OK_PIN 7U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_BUTTON_OK_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTE8 (number 11), BUTTON_LF
  @{ */

