CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_BUTTON_LF_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_BUTTON_LF_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_BUTTON_LF_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_BUTTON_LF_PIN 8U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_BUTTON_LF_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTE9 (number 12), BUTTON_RT
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_BUTTON_RT_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_BUTTON_RT_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_BUTTON_RT_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_BUTTON_RT_PIN 9U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_BUTTON_RT_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTE10 (number 13), BUTTON_UP
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_BUTTON_UP_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_BUTTON_UP_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_BUTTON_UP_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_BUTTON_UP_PIN 10U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_BUTTON_UP_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTE11 (number 14), BUTTON_DN
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_BUTTON_DN_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_BUTTON_DN_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_BUTTON_DN_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_BUTTON_DN_PIN 11U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_BUTTON_DN_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTA9 (number 61), SWITCH_0
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_SWITCH_0_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_SWITCH_0_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_SWITCH_0_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_SWITCH_0_PIN 9U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_SWITCH_0_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTA11 (number 63), SWITCH_1
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_SWITCH_1_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_SWITCH_1_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_SWITCH_1_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_SWITCH_1_PIN 11U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_SWITCH_1_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTA13 (number 65), SWITCH_2
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_SWITCH_2_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_SWITCH_2_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_SWITCH_2_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_SWITCH_2_PIN 13U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_SWITCH_2_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTA15 (number 67), SWITCH_3
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_SWITCH_3_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_SWITCH_3_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_SWITCH_3_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_SWITCH_3_PIN 15U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_SWITCH_3_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTB0 (number 81), ENCO_LA
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_ENCO_LA_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_ENCO_LA_PIN 0U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_ENCO_LA_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTB1 (number 82), ENCO_LB
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_ENCO_LB_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_ENCO_LB_PIN 1U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_ENCO_LB_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTB18 (number 97), ENCO_RA
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_ENCO_RA_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_ENCO_RA_PIN 18U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_ENCO_RA_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTB19 (number 98), ENCO_RB
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_ENCO_RB_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_ENCO_RB_PIN 19U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_ENCO_RB_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                       /* @} */

