CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.h
/*! @name PORTE12 (number 15), SERVO_0
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_SERVO_0_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_SERVO_0_PIN 12U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_SERVO_0_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE0 (number 1), SD_D_1
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_SD_D_1_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_SD_D_1_PIN 0U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_SD_D_1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTE1 (number 2), SD_D_0
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_SD_D_0_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_SD_D_0_PIN 1U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_SD_D_0_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTE2 (number 3), SD_CLK
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_SD_CLK_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_SD_CLK_PIN 2U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_SD_CLK_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTE3 (number 4), SD_CMD
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_SD_CMD_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_SD_CMD_PIN 3U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_SD_CMD_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTC1 (number 104), MOTOR_RA
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_MOTOR_RA_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_MOTOR_RA_PIN 1U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_MOTOR_RA_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC2 (number 105), MOTOR_RB
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_MOTOR_RB_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_MOTOR_RB_PIN 2U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_MOTOR_RB_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC3 (number 106), MOTOR_LA
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_MOTOR_LA_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_MOTOR_LA_PIN 3U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_MOTOR_LA_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC4 (number 109), MOTOR_LB
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_MOTOR_LB_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_MOTOR_LB_PIN 4U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_MOTOR_LB_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTD12 (number 141), OLED_SCK
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_OLED_SCK_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_OLED_SCK_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_OLED_SCK_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_OLED_SCK_PIN 12U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_OLED_SCK_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTD13 (number 142), OLED_RST
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_BASIC_OLED_RST_GPIO GPIOD                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_BASIC_OLED_RST_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_BASIC_OLED_RST_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_BASIC_OLED_RST_PIN 13U                   /*!<@brief PORT pin number */
#define RTEPIN_BASIC_OLED_RST_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_Basic(void);

/*! @name PORTE0 (number 1), SD_D_1
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_SD_D_1_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_SD_D_1_PIN 0U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_SD_D_1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE1 (number 2), SD_D_0
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_SD_D_0_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_SD_D_0_PIN 1U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_SD_D_0_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                       /* @} */

