CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.h
/*! @name PORTE2 (number 3), SD_CLK
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_SD_CLK_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_SD_CLK_PIN 2U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_SD_CLK_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE3 (number 4), SD_CMD
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_SD_CMD_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_SD_CMD_PIN 3U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_SD_CMD_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE5 (number 8), SD_D_2
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_SD_D_2_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_SD_D_2_PIN 5U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_SD_D_2_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE4 (number 7), SD_D_3
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_SD_D_3_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_SD_D_3_PIN 4U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_SD_D_3_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTE7 (number 10), BUTTON_OK
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_BUTTON_OK_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_BUTTON_OK_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_BUTTON_OK_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_BUTTON_OK_PIN 7U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_BUTTON_OK_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTE8 (number 11), BUTTON_LF
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_BUTTON_LF_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_BUTTON_LF_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_BUTTON_LF_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_BUTTON_LF_PIN 8U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_BUTTON_LF_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTE9 (number 12), BUTTON_RT
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_BUTTON_RT_GPIO GPIOE               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_BUTTON_RT_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_BUTTON_RT_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_BUTTON_RT_PIN 9U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_BUTTON_RT_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTE10 (number 13), BUTTON_UP
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_BUTTON_UP_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_BUTTON_UP_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_BUTTON_UP_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_BUTTON_UP_PIN 10U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_BUTTON_UP_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTE11 (number 14), BUTTON_DN
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_BUTTON_DN_GPIO GPIOE                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_BUTTON_DN_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_BUTTON_DN_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_BUTTON_DN_PIN 11U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_BUTTON_DN_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTE12 (number 15), SERVO_0
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_SERVO_0_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_SERVO_0_PIN 12U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_SERVO_0_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTA0 (number 50), SWO_CLK
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_SWO_CLK_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_SWO_CLK_PIN 0U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_SWO_CLK_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTA3 (number 53), SWO_DIO
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_SWO_DIO_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_SWO_DIO_PIN 3U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_SWO_DIO_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTA9 (number 61), SWITCH_0
  @{ */

