CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_SWITCH_0_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_SWITCH_0_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_SWITCH_0_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_SWITCH_0_PIN 9U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_SWITCH_0_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTA11 (number 63), SWITCH_1
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_SWITCH_1_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_SWITCH_1_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_SWITCH_1_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_SWITCH_1_PIN 11U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_SWITCH_1_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTA13 (number 65), SWITCH_2
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_SWITCH_2_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_SWITCH_2_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_SWITCH_2_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_SWITCH_2_PIN 13U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_SWITCH_2_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTA15 (number 67), SWITCH_3
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_SWITCH_3_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_SWITCH_3_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_SWITCH_3_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_SWITCH_3_PIN 15U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_SWITCH_3_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTB0 (number 81), ENCO_LA
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_ENCO_LA_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_ENCO_LA_PIN 0U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_ENCO_LA_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTB1 (number 82), ENCO_LB
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_ENCO_LB_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_ENCO_LB_PIN 1U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_ENCO_LB_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTB18 (number 97), ENCO_RA
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_ENCO_RA_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_ENCO_RA_PIN 18U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_ENCO_RA_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTB19 (number 98), ENCO_RB
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_ENCO_RB_PORT PORTB                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_ENCO_RB_PIN 19U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_ENCO_RB_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTC6 (number 111), CAM_VSNC
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_CAM_VSNC_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_VSNC_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_CAM_VSNC_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_VSNC_PIN 6U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_CAM_VSNC_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTC8 (number 113), CAM_D_0
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_CAM_D_0_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_D_0_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_CAM_D_0_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_D_0_PIN 8U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_CAM_D_0_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTC9 (number 114), CAM_D_1
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_CAM_D_1_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_D_1_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_CAM_D_1_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_D_1_PIN 9U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_CAM_D_1_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                        /* @} */

