CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.h
/*! @name PORTC10 (number 115), CAM_D_2
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_CAM_D_2_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_D_2_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_CAM_D_2_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_D_2_PIN 10U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_CAM_D_2_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTC11 (number 116), CAM_D_3
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_CAM_D_3_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_D_3_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_CAM_D_3_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_D_3_PIN 11U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_CAM_D_3_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTC12 (number 117), CAM_D_4
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_CAM_D_4_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_D_4_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_CAM_D_4_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_D_4_PIN 12U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_CAM_D_4_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTC13 (number 118), CAM_D_5
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_CAM_D_5_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_D_5_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_CAM_D_5_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_D_5_PIN 13U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_CAM_D_5_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTC14 (number 119), CAM_D_6
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_CAM_D_6_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_D_6_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_CAM_D_6_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_D_6_PIN 14U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_CAM_D_6_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTC15 (number 120), CAM_D_7
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_CAM_D_7_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_D_7_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_CAM_D_7_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_D_7_PIN 15U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_CAM_D_7_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTC18 (number 125), CAM_PCLK
  @{ */

/* Symbols to be used with GPIO driver */
#define RTEPIN_DIGITAL_CAM_PCLK_GPIO GPIOC                /*!<@brief GPIO peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_PCLK_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define RTEPIN_DIGITAL_CAM_PCLK_PORT PORTC                /*!<@brief PORT peripheral base pointer */
#define RTEPIN_DIGITAL_CAM_PCLK_PIN 18U                   /*!<@brief PORT pin number */
#define RTEPIN_DIGITAL_CAM_PCLK_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_Digital(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_Analog(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTA1 (number 51), UART_DBG_RX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_UART0_DBG_UART_DBG_RX_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_UART0_DBG_UART_DBG_RX_PIN 1U                   /*!<@brief PORT pin number */
#define RTEPIN_UART0_DBG_UART_DBG_RX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORTA2 (number 52), UART_DBG_TX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_UART0_DBG_UART_DBG_TX_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_UART0_DBG_UART_DBG_TX_PIN 2U                   /*!<@brief PORT pin number */
#define RTEPIN_UART0_DBG_UART_DBG_TX_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_UART0_DBG(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTD6 (number 133), UART_WLAN_RX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_UART0_WLAN_UART_WLAN_RX_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_UART0_WLAN_UART_WLAN_RX_PIN 6U                   /*!<@brief PORT pin number */
#define RTEPIN_UART0_WLAN_UART_WLAN_RX_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORTD7 (number 136), UART_WLAN_TX
  @{ */

/* Symbols to be used with PORT driver */
#define RTEPIN_UART0_WLAN_UART_WLAN_TX_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define RTEPIN_UART0_WLAN_UART_WLAN_TX_PIN 7U                   /*!<@brief PORT pin number */
#define RTEPIN_UART0_WLAN_UART_WLAN_TX_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_UART0_WLAN(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
